Revit 2024 API
BuiltInFailures.MEPCalculationFailures.NetworkExtraPumpOutsideSet Property
 Flow calculations do not calculate this pump together with the other pumps as one equipment set. Verify the flow distribution and add the pump to the equipment set, if desired.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NetworkExtraPumpOutsideSet { get; }
Visual Basic
Public Shared ReadOnly Property NetworkExtraPumpOutsideSet As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NetworkExtraPumpOutsideSet {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace